{
    "en": {
        "info-footer.language": "Language:",
        "info-footer.credits.ide-assets": "Assets used in IDE interface:",
        "info-footer.credits.game": "Assets used in game:",
        "info-footer.links": "Useful links:",
        "info-footer.links.github.1": "Found an issue?",
        "info-footer.links.github.2": "Contribute to Github",
        "info-footer.links.slides.1": "Consult with the workshop",
        "info-footer.links.slides.2": "slides for more tips & trics",
        "info-footer.collaboration.ri": "In collaboration with:",
        "info-footer.debug": "Debug:",
        "info-footer.nuke-user-data.entry": "Nuke user data",
        "info-footer.nuke-user-data.sure": "Are you sure?",
        "info-footer.nuke-user-data.suresure": "Are you absolutely sure?",
        "info-footer.nuke-user-data.erasedata": "This will erase ALL user data",
        "info-footer.nuke-user-data.confirm": "Click to proceed (no return point)",

        "window-size-warning": "Sorry, the window size is too small for comfortable IDE usages. Please try resizing the window, increasing your screen resolution, or using a device with a larger display.",

        "pages-all.level-layout.title": "Your level layout:",

        "page-1.title": "Exercise 1: Learn and Play",
        "page-1.description": "<p>Welcome to your very first activity!</p><p>Before we dive into creating anything, let's take a moment to explore how the game works. In this step, you will play <span class=\"logo\">the Legend of Royal Institution</span> (a maze game) and observe how it behaves.</p><p>Put on your game designer hat and figure out how the game works. The following questions will help you to start:</p><ul><li>What are the rules of the maze?</li><li>How does the player move through it?</li><li>What marks the end of the game?</li></ul><p>Use the <strong>text boxes below</strong> to jot down any rules, patterns, or interesting game mechanics you notice.</p><p>As you explore the game, start thinking about how you could make it more interesting or challenging. What new <strong>game mechanics</strong> could you add? Think about how these elements could change the way the game is played and how they might make it more fun or challenging.</p><p>P.S.: There are no wrong answers! This is all about being curious and observant.</p>",
        "page-1.mechanics.title": "Observed mechanics:",
        "page-1.mechanics.placeholder": "Here are a few ideas for the game rules:\nThe character moves when user clicks a button\nGame starts with a dialog\n…",
        "page-1.further-improvements.title": "Further improvements:",
        "page-1.further-improvements.placeholder": "Spawn the character randomly at some pre-defined start point\n…",

        "page-2.title": "Exercise 2: Kicking off the plot!",
        "page-2.description": "<p>Great job exploring the game. In this activity, you're stepping into the role of a <span class=\"highlight\">narrative designer</span>.</p> <p>You'll get a chance to change the <strong>dialogues</strong> that appear in important moments of the game:</p><ul><li><strong>Game Intro</strong>: the message players see before the gameplay begins. This message should help to justify the gameplay.</li><li><strong>Game Over</strong>: a message that is shown when the player fails to complete a level.</li><li><strong>Victory</strong>: the celebratory message when the player finishes the maze.</li></ul><p>Take a few moments to play the maze game again and pay close attention to the text that appears during these scenarios. Then, think about how you would change.</p><p>Do you want to make it more dramatic, silly, mysterious, or even motivational? Use the <strong>text boxes below</strong> to rewrite each of the three dialogues in your own style. Be creative and have fun with it!</p>",
        "page-2.messages.game-intro.title": "\"Game Intro\" message:",
        "page-2.messages.game-intro.description": "Tip: 2-3 words per line, max 7 lines.",
        "page-2.messages.game-intro.placeholder": "I am a template message,\nI am required to setup the gameplay",
        "page-2.messages.game-over.title": "[Optional] \"Game Over\" message:",
        "page-2.messages.game-over.description": "Tip: 2-3 words per line, max 7 lines.",
        "page-2.messages.game-over.placeholder": "That is all folks!",
        "page-2.messages.victory.title": "[Optional] \"Victory\" message:",
        "page-2.messages.victory.description": "Tip: 2-3 words per line, max 7 lines.",
        "page-2.messages.victory.placeholder": "Congratulations!\nWell done.",

        "page-3.title": "Exercise 3: Designing your first level layout",
        "page-3.description": "<p>Time to put your level design skills to work.</p><p>In this exercise, you'll be designing your very first custom maze layout.</p><p>Your maze should be <strong>16 tiles wide</strong> and <strong>12 tiles high</strong>, but don't worry if it is bigger or smaller than <strong>16x12</strong> the layout will be expanded or cropped depending respectively.</p><p>You should use the next symbols to build a successful layout:<ul><li><code>W0</code> to represent walls</li><li><code>.</code> (a dot) to represent empty spaces that the player can walk through.</li><li><code>SP</code> starting point. You can place a few of them around the maze, then one will be randomly chosen.</li><li><code>F0</code> for the finish point. You can also have a few of them in your layout the same as <code>SP</code>.</li></ul></p><p>Focus on building a clear, playable layout. Think about where the player might start, where they could go, and how the maze flows.</p><p>Treat it like the skeleton of your level!</p><p>P.S.: If your game is stuck at some point, just refresh the page. Don't worry all saved data will be restored.</p>",

        "page-4.title": "Exercise 4: Improving the visual appearance",
        "page-4.description": "<p>Now that your level structure is in place, it's time to enhance its visual appearance using custom tile mapping.</p><p>In this exercise, you'll define how each tile should look by providing a list of <strong>tile IDs</strong> (ordinal values) that will be mapped to specific tile types in your maze.</p><p>Each tile ID you enter will be automatically assigned to a corresponding tile code: the first value becomes <code>W0</code>, the second <code>W1</code>, and so on—up to <code>WN</code>, where <strong>N</strong> is the index of the last value you provide.</p><p>Enter your tile IDs in the text box below, separated by commas (e.g., <code>17, 21, 34, 56</code>). These values will control how each wall tile appears in the final rendered game.</p><p>You can be creative here! Think of these tile IDs as different styles or textures: cracked stone, mossy brick, or a broken piece of wall. Just be sure to keep the order consistent with how you'll use <code>W0</code>, <code>W1</code>, etc., in your maze layout.</p><p>Below is an image to help you identify tiles in your game.</p><img src=\"@public/tiles-examples-walls.png\" width=\"500\"></img><a class=\"button\" href=\"@public/tiles-examples-full.png\" target=\"__blank\"><img src=\"@public/icons/arrow-up-right-square-fill.svg\" />See full tilemap</a>",
        "page-4.walls.title": "Wall tile IDs:",
        "page-4.walls.description": "Tip: comma-separated list of numbers.",

        "page-5.title": "Exercise 5: Adding coins",
        "page-5.description": "<p>Now it's time to populate the maze with collectible <strong>coins</strong> to make gameplay more rewarding.</p><p>In this exercise, you'll define the coin tiles that players can collect by providing a list of <strong>tile IDs</strong> (ordinal values) and optionally assigning them different scores. Each coin tile ID will be mapped to a code starting from <code>C0</code>, <code>C1</code>, and so on—up to <code>CN</code>, where <strong>N</strong> is the index of the last coin you define (similar to what you already achieved with the walls config).</p><p>There are three parts to this setup:</p><ol><li><strong>Default Coin Score</strong>: a positive number that is used as the score for any coin tile that doesn't have a custom score assigned.</li> <li><strong>Scores List</strong>: a list of specific scores assigned to every coin. Each line should be in the format <code>X Y</code>, where <code>X</code> is the coin code (a number in <code>C0</code>, <code>C1</code>, ... <code>CN</code>), and <code>Y</code> is the score. Example: <pre>0 5</pre><pre>2 10</pre></li><li><strong>Coin Tile IDs list</strong> a list of tile IDs (e.g., <code>12, 23, 45</code>) that will be used for coins. These values correspond to the tiles shown in the image below and will be mapped to <code>C0</code>, <code>C1</code>, etc.</li></ol><p>Once you've defined your coins and scores, you'll be able to place them directly into your maze layout using the <code>CX</code> codes.</p><p>Below is an image to help you select the coin tile IDs:</p><img src=\"@public/tiles-examples-gems.png\" width=\"500\" /><p>Add your coins using the fields below, and then update your maze layout accordingly. Have fun designing your collectible paths!</p><a class=\"button\" href=\"@public/tiles-examples-full-gems.png\" target=\"__blank\"><img src=\"@public/icons/arrow-up-right-square-fill.svg\" />See Gems tilemap</a>",
        "page-5.default-score.title": "[Optional] Default score:",
        "page-5.default-score.description": "Tip: a single positive number.",
        "page-5.values.title": "[Optional] Values:",
        "page-5.values.description": "Tip: a list of pairs separated by a new line. Every pair consists of coin id and score separated by space.",
        "page-5.tiles.title": "Coin tile IDs:",
        "page-5.tiles.description": "Tip: comma-separated list of numbers.",

        "page-6.title": "Exercise 6: Dynamic maze layout",
        "page-6.description": "<p>Now let's turn around our core game mechanic: make the layout dynamic by introducing <strong class=\"highlight\">keys and doors</strong>. This feature adds challenge and progression to your level by requiring players to collect specific keys to unlock matching doors.</p><p>In this exercise, you'll define which tile IDs represent <strong>keys</strong>, <strong>doors</strong>, and optionally, the <strong>closed versions of doors</strong>. Each key and door pair will be mapped with a unique code: <code>K0</code>/<code>D0</code>, <code>K1</code>/<code>D1</code>, and so on.</p> <p>Here's how to set it up:</p><ol><li><strong>Keys</strong>: enter the tile IDs for all the keys in your level (e.g., <code>14, 33, 47</code>). Similar to what we worked with before: the first ID becomes <code>K0</code>, the second <code>K1</code>, and so on.</li><li><strong>Doors</strong>: the corresponding tile IDs for doors (e.g., <code>28, 39, 52</code>). These will be assigned as <code>D0</code>, <code>D1</code>, etc. There must be exactly one door tile per key tile.</li> <li><strong>Open Door Tile IDs</strong>: a list of tiles to use for unblocked doors. Character can travel through the open doors. If you only provide one value, all doors will use <strong>that tile</strong>. If you provide more than one, the number of open door tiles <strong>must exactly match the number of doors (aka closed doors)</strong> and be listed in the same order.</li></ol><p>Once you've defined your keys and doors, you can use <code>K0</code>, <code>K1</code>, ... and <code>D0</code>, <code>D1</code>, ... directly in your maze layout to place them where needed.</p><p>These images will help you identify the correct tile IDs for keys and doors:</p><p><strong>Key Tile IDs</strong>:</p><img src=\"@public/tiles-examples-keys.png\" width=\"500\" /><p><strong>Door Tile IDs</strong>:</p> <img src=\"@public/tiles-examples-doors.png\" width=\"500\" /><p>This will make your maze more interactive and strategic!</p><a class=\"button\" href=\"@public/tiles-examples-full-tools.png\" target=\"__blank\"><img src=\"@public/icons/arrow-up-right-square-fill.svg\" />See Tools tilemap</a><a class=\"button\" href=\"@public/tiles-examples-full.png\" target=\"__blank\"><img src=\"@public/icons/arrow-up-right-square-fill.svg\" />See full tilemap</a>",
        "page-6.keys.title": "Key tile IDs:",
        "page-6.keys.description": "Tip: comma-separated list of numbers.",
        "page-6.close-doors.title": "Close door tile IDs:",
        "page-6.close-doors.description": "Tip: comma-separated list of numbers.",
        "page-6.open-doors.title": "Open door tile IDs:",
        "page-6.open-doors.description": "Tip: a single number or comma-separated list of numbers.",

        "page-7.title": "Exercise 7: Adding monsters 👿",
        "page-7.description": "<p>It's time to bring your level to life with some <strong>monster logic</strong>! In this exercise, you'll define how monsters behave by specifying their spawn points, movement patterns, and update timing.</p><p>You'll provide your monster configurations using a text field below. Each line represents one monster and follows this exact format:</p><pre>tileID updateTimeMs direction1 direction2 ... directionN</pre><p>Here's what each part means:</p><ul><li><li><strong>tileID</strong>: the tile ID used to visually represent the monster.</li><li><strong>updateTimeMs</strong>: the time (in milliseconds) between each movement of your creature. For example, <code>500</code> means the monster updates its position twice in a second (every half a second).</li><li><strong>directions</strong> a sequence of movement directions the monster will follow in order. Valid directions are: <code>left</code>, <code>right</code>, <code>up</code>, <code>down</code>.<strong>Directions list should move the monster in a way that it starts and finishes in the exactly same point.</strong></li></ul><p>The first monster becomes <code>M0</code>, the second <code>M1</code>, and so on.</p> <p>See an example:</p> <pre>27 1000 right down down up up left<br>33 500 left left right right</pre><p>In this example: <ul><li><code>M0</code> uses tile ID 27, updates every 1000ms, and moves in a knight (chess figure) pattern.</li><li><code>M1</code> uses tile ID 33, updates every 500ms, and moves two steps left and then back right, repeating that pattern.</li></ul></p> <p>Once defined, you can place monsters in your maze using <code>M0</code>, <code>M1</code>, etc., just like other entities.</p> <p>This logic lets you create patrol patterns, chase paths, or timed threats. Get creative with how you design their movement!</p><p>Below is the image of monster tiles:</p><img src=\"@public/tiles-examples-creatures.png\" width=\"600\"></img><a class=\"button\" href=\"@public/tiles-examples-full-creatures.png\" target=\"__blank\"><img src=\"@public/icons/arrow-up-right-square-fill.svg\" />See Creatures tilemap</a>",
        "page-7.monsters.title": "Monsters config:",
        "page-7.monsters.description": "Tip: multiline text. Every line is space separated and follows: tileID updateTimeMs direction1 direction2 ... directionN.",

        "page-8.title": "Exercise 8: 🐣 Easter eggs?!",
        "page-8.description": "<p>We're almost done! Now let's place the finishing touches on your level by adding optional <strong>garnitures</strong> to make your level feel more alive and complete.</p><p>This exercise is all about defining which tiles represent these special elements.</p><p>Garnitures are additional visual or thematic elements like grass, torches, banners, or any decorative details that don't affect gameplay, or do they?</p><p>There is a field below to complete:</p><ol><li><strong>Garniture Tile IDs</strong>: a \"new line\"-separated list of tile IDs with a boolean flag (<code>true</code> or <code>false</code>) displaying whether they should be collideable (e.g., <code>201 false<br>301 true</code>). The lines will be mapped to <code>G0</code>, <code>G1</code>, ..., <code>GN</code>.</li></ol><p>Once you've defined the garnitures config, you can place them directly into your maze layout.</p><p>Here's a peculiar example of how your layout might use them: you can use non-collideable garniture representing a wall tile to create a hidden passage to a secret room (but use distinguishable tile to help user to understand this is not a regular wall).</p><p>It polishes your game layout and sprinkles extra challenge for a player.</p><p>Ready to wrap up your level? Add your garnitures using the fields below, and update your layout to complete your masterpiece!</p><p>Below is the image with garniture tile IDs:</p><img src=\"@public/tiles-examples-garnitures.png\" width=\"350\"></img><a class=\"button\" href=\"@public/tiles-examples-full.png\" target=\"__blank\"><img src=\"@public/icons/arrow-up-right-square-fill.svg\" />See full tilemap</a>",
        "page-8.garniture.title": "Garnitures config:",
        "page-8.garniture.description": "Tip: multiline text. Every line is space separated pair of tileID and a boolean flag.",

        "page-9.title": "Exercise 9: Polishing level layout",
        "page-9.description": "<p>Great work so far! Now let's give your <strong>flag</strong> a bit of extra flair by defining different <strong>appearances</strong>.</p><p>In this exercise, you'll provide a list of <strong>tile IDs</strong> that represent the different flags. These tiles will be automatically assigned as <code>F0</code>, <code>F1</code>, <code>F2</code>, and so on, in the exact same order you list them.</p><p>This allows your flag to have different appearance within the same level to make the layout harder to memorise and add some customisation to your design.</p><p><strong>Instructions:</strong></p><ul><li>Enter a comma-separated list of tile IDs (e.g., <code>120, 121, 122</code>).</li> <li>The first tile becomes <code>F0</code>, the second <code>F1</code>, and so on.</li></ul><p>Once assigned, you can reference <code>F0</code>, <code>F1</code>, etc. in your level layout.</p><p>Below is the image with flag tile IDs</p><img src=\"@public/tiles-examples-flags.png\" width=\"500\"></img><p>Time to make that flag wave proudly!</p><a class=\"button\" href=\"@public/tiles-examples-full.png\" target=\"__blank\"><img src=\"@public/icons/arrow-up-right-square-fill.svg\" />See full tilemap</a>",
        "page-9.garniture.title": "Flag tile IDs:",
        "page-9.garniture.description": "Tip: comma-separated list of numbers",

        "page-10.title": "Exercise 10: Level constraints",
        "page-10.description": "<p>Now that your level is built and decorated, let's make it more challenging by defining the <strong>constraints and win conditions</strong>.</p><p>In this exercise, you'll configure how the level behaves in terms of time, movement, and scoring. These constraints help shape the difficulty and strategy of your level—forcing players to plan carefully, move efficiently, or collect more before they can win.</p><p>You can adjust the following values:</p><ol><li><strong>Max time (in seconds)</strong>: the total amount of time a player has to complete the level.</li><li><strong>Max moves</strong>: the maximum number of moves the player can make.</li><li><strong>Minimum score</strong>: the minimum score the player must collect before the flag appears in the level.</li></ol><p>Here's an example configuration:</p><pre> Max time: 60<br>Max steps: 200</pre><p>With this setup, the player has 60 seconds and 200 moves available to completel the level.</p><p>Ready to tweak your level's challenge? Enter your constraint values below and test how they change the gameplay experience!</p>",
        "page-10.max-time.title": "[Optional] Max time:",
        "page-10.max-time.description": "Tip: a positive integer in seconds.",
        "page-10.max-moves.title": "[Optional] Max moves:",
        "page-10.max-moves.description": "Tip: a positive integer, defines how much moves a character can take before the game stops.",
        "page-10.min-score.title": "[Optional] Min score:",
        "page-10.min-score.description": "Tip: a positive integer, defines when flag appears on the level.",

        "page-11.title": "Exercise 11: Special effects",
        "page-11.description": "<p>You've built your level, added gameplay elements, and tuned its rules. Now it's time to give it a name and add some <strong>special effects</strong> to make it truly stand out!</p> <p>In this exercise, you'll set the <strong>title of your level</strong> and optionally apply <strong>post-processing effects</strong> that change how it looks and feels during gameplay.</p><p>There are three settings to configure:</p><ol><li><strong>Level title:</strong> enter a short, catchy name for your level. The title is displayed in the top right corner of the level.</li><li><strong>Cathode Ray Tube Effect:</strong> toggle this on to apply a subtle screen distortion and scan-line effect, similar to the look of an old CRT television. Great for retro vibes 📺</li><li><strong>Fog of War Effect:</strong> toggle this on to restrict player visibility, revealing only areas near the player's position. Perfect for sprinking more challenge.</li></ol><p>With this setup, your level will start with a dramatic, old-TV aesthetic and players will only see the immediate area around them—making exploration more intense</p>",
        "page-11.level-title.title": "Level title:",
        "page-11.level-title.description": "Tip: a string of maximum 20 characters.",
        "page-11.level-title.placeholder": "My very first level",
        "page-11.effect.crt.title": "Apply Cathode Ray Tube Effect",
        "page-11.effect.crt.description": "Simulates an old TV with a big belly 📺",
        "page-11.effect.fow.title": "Apply Fog of War Effect",
        "page-11.effect.fow.description": "Restricts visibility to a really small area.",

        "page-12.title": "Exercise 12: Reflect and Refine Your Game Mechanics",
        "page-12.description": "<p>In the very first exercise, you identified several game mechanics that you wanted to improve or add to the game.</p><p>Now that you've built and customized your level, it's time to reflect on your work.</p> <p>Use the text box below to:</p><ul><li>Describe which game mechanics you originally identified as needing improvement or addition.</li><li>Explain how you implemented these mechanics throughout your level.</li><li>Compare your initial ideas with the final implementation. What changed, what worked well, and what could be improved further.</li></ul><p>This exercise helps you think critically about your design choices and learn from your creative process.</p>",
        "page-12.features.title": "Mechanics to add:",
        "page-12.features.description": "Revisit mechanics you identified and see whether they are a good fit.",
        "page-12.features.placeholder": "Spawn the character randomly at some pre-defined start point\nPlayer collects the coins\n…",

        "page-13.title": "Exercise 13: Share Your Creation",
        "page-13.description": "<p>You completed your level. It is time to let others experience it similar to professional game developers preparing their game for production!</p><p>In this exercise, you will download the <strong>game configuration file</strong> you created during the workshop and share it with another student sitting near you. This way, you can explore each other's work, exchange feedback, and get inspired by different design approaches.</p><p>Click the <strong>Download my config</strong> button to save your game configuration file to the disk. This file contains all of the settings, tiles, and level constraints you built so far.</p><p>Share the file with another student: either by sending it digitally (USB stick, chat app, etc.) or by swapping devices briefly (in case there is no way to share files).</p><p>Load their configuration into your editor using <string>Load someone's config</strong>.</p><p>Discuss the similarities and differences between your designs and give each other constructive feedback.</p>",
        "page-13.share.title": "Share your config:",
        "page-13.share.description": "It is time to release your config to production. Use buttons below to download and upload config files.",

        "page-demo-local-config.title": "Upload Your Own Config",
        "page-demo-local-config.description": "<p>Welcome to the tool allowing you to load custom game configs into the game.</p><p>This demonstrates the ability of the game to run custom config files and shows its outstanding flexibility.</p>",
        "page-demo-local-config.upload.title": "Config uploader:",
        "page-demo-local-config.upload.description": "Download saves a globally available game config, upload plays the config from disk.",

        "page-demo-ri-meeting.title": "Monday Meeting Demo",
        "page-demo-ri-meeting.description": "<p>Welcome to the Monday demo presented on <strong>21.07.25</strong></p><p>This demonstration showcases the full progression of potential exercises within the workshop experience. Students begin by exploring what makes up a video game its gameplay, mechanics, and end goals before diving into an analytical playthrough of a sample maze to identify existing rules and brainstorm new mechanics.</p><p>Next, they'll learn how to build their own custom level using data-driven design principles: configure wall layouts, define tile types, and bring their mazes to life.</p><p>Once a level is set, we'll implement mechanics like coins with varying point values, doors, and keys, then take on a design challenge to place those elements thoughtfully for an engaging gameplay experience.</p><p>From there, they'll explore simple AI concepts by imagining and prototyping monster behavior using text-based config files.</p><p>Finally, we'll spice things up with creative ideas—think secret levels, easter eggs, move limits, timers, and collectible challenges to make the game unique and fun.</p><p>This demo is a comprehensive journey through game design fundamentals using a hands-on, iterative approach. Have fun exploring and creating!</p><p>The levels included into this version are:<ol><li>Intro with basic mechanices</li><li>Gems</li><li>Doors</li><li>Monsters AI</li><li>Garniture: easter eggs</li><li>FX: Fog of War</li><li>Custom wall asset</li></ol><p>The game config can be found <a href=\"https://github.com/st235/RoyalInstitution.IntroductionToGameDevelopment.v4/blob/main/src/assets/game/demos/ri_monday_demo.json\" target=\"_blank\">here</a>.</p>"
    },
    "ru": {
        "info-footer.language": "Язык:",
        "info-footer.credits.ide-assets": "Ресурсы, использованные в интерфейсе IDE:",
        "info-footer.credits.game": "Ресурсы, использованные в игре:",
        "info-footer.links": "Полезные ссылки:",
        "info-footer.links.github.1": "Нашли проблему?",
        "info-footer.links.github.2": "Сообщите о ней через Github",
        "info-footer.links.slides.1": "Остались вопросы?",
        "info-footer.links.slides.2": "Посмотрите слайды, чтобы узнать больше",
        "info-footer.collaboration.ri": "В сотрудничестве с:",
        "info-footer.debug": "Отладка:",
        "info-footer.nuke-user-data.entry": "Стереть пользовательские данные",
        "info-footer.nuke-user-data.sure": "Вы уверены?",
        "info-footer.nuke-user-data.suresure": "Вы точно уверены?",
        "info-footer.nuke-user-data.erasedata": "Действие удалит ВСЕ данные",
        "info-footer.nuke-user-data.confirm": "Подтвердите (точка невозврата)",

        "window-size-warning": "К сожалению, размер окна слишком мал для комфортного использования IDE. Попробуйте изменить размер окна, увеличить разрешение экрана или использовать устройство с большим дисплеем.",

        "pages-all.level-layout.title": "Ваш level layout:",

        "page-1.title": "Упражнение 1: Играй и Учись!",
        "page-1.description": "<p>Добро пожаловать в ваше самое первое задание!</p><p>Перед тем как мы начнём что-то создавать, давайте немного поизучаем, как устроена игра. В этом шаге вы будете играть в <span class=\"logo\">the Legend of Royal Institution</span> (лабиринт) и наблюдать, как он работает.</p><p>Наденьте шляпу game designer'а и разберитесь, как работает игра. Следующие вопросы помогут начать:</p><ul><li>Каковы правила лабиринта?</li><li>Как игрок перемещается?</li><li>Что означает конец игры?</li></ul><p>Используйте <strong>текстовые поля ниже</strong>, чтобы записывать любые правила, паттерны или интересные game mechanics, которые вы заметите.</p><p>Исследуя игру, подумайте, как можно сделать её интереснее или сложнее. Какие новые <strong>game mechanics</strong> можно добавить? Как эти элементы могут изменить геймплей?</p><p>P.S.: Нет неправильных ответов! Главное — быть любопытными и наблюдательными.</p>",

        "page-1.mechanics.title": "Наблюдаемые особенности игры:",
        "page-1.mechanics.placeholder": "Несколько идей по правилам:\nПерсонаж движется, когда пользователь нажимает кнопку\nИгра начинается с диалога\n…",
        "page-1.further-improvements.title": "Дальнейшие улучшения:",
        "page-1.further-improvements.placeholder": "Spawn персонажа случайным образом в одном из стартовых пунктов\n…",


        "page-2.title": "Упражнение 2: Добавляем сюжет!",
        "page-2.description": "<p>Отличная работа в изучении игры. В этом упражнении вы становитесь <span class=\"highlight\">narrative designer'ом</span>.</p> <p>Вы получите возможность изменить <strong>диалоги</strong>, которые появляются в ключевые моменты игры:</p><ul><li><strong>Game Intro</strong>: сообщение перед началом игры. Оно должно объяснять происходящее.</li><li><strong>Game Over</strong>: сообщение, когда игрок не проходит уровень.</li><li><strong>Victory</strong>: сообщение, когда игрок завершает лабиринт.</li></ul><p>Поиграйте снова и обратите внимание на текст, который появляется в этих случаях. Подумайте, как бы вы его изменили.</p><p>Хотите сделать его драматичным? смешным? загадочным? мотивирующим? Используйте <strong>поля ниже</strong>, чтобы переписать эти три диалога в своём стиле.</p>",
        "page-2.messages.game-intro.title": "Сообщение \"Game Intro\":",
        "page-2.messages.game-intro.description": "Подсказка: 2–3 слова в строке, максимум 7 строк.",
        "page-2.messages.game-intro.placeholder": "I am a template message,\nI am required to setup the gameplay",
        "page-2.messages.game-over.title": "[Необязательное задание] Сообщение \"Game Over\":",
        "page-2.messages.game-over.description": "Подсказка: 2–3 слова в строке, максимум 7 строк.",
        "page-2.messages.game-over.placeholder": "That is all folks!",
        "page-2.messages.victory.title": "[Необязательное задание] Сообщение \"Victory\":",
        "page-2.messages.victory.description": "Подсказка: 2–3 слова в строке, максимум 7 строк.",
        "page-2.messages.victory.placeholder": "Congratulations!\nWell done.",

        "page-3.title": "Упражнение 3: Разрабатываем первый лабиринт",
        "page-3.description": "<p>Теперь время применить навыки level design.</p><p>В этом упражнении вы будете проектировать свой первый собственный layout лабиринта.</p><p>Лабиринт должен быть <strong>16 тайлов шириной</strong> и <strong>12 тайлов высотой</strong>, но не переживайте, если больше или меньше — разметка вашего уровня будет расширена или обрезана автоматически.</p><p>Используйте следующие символы для построения разметки уровня:</p><ul><li><code>W0</code> — стены</li><li><code>.</code> (точка) — пустые клетки, по которым может ходить игрок.</li><li><code>SP</code> — старт. Можно разместить несколько, будет выбран случайный.</li><li><code>F0</code> — финиш. Также можно несколько, аналогично <code>SP</code>.</li></ul><p>Сосредоточьтесь на том, чтобы layout был понятным и играбельным. Подумайте, где игрок начинает, куда может пройти и как выстроен маршрут.</p><p>Относитесь к этому как к «скелету» уровня!</p><p>P.S.: Если игра зависла, просто обновите страницу. Все данные сохраняются.</p>",


        "page-4.title": "Упражнение 4: Улучшаем визуал",
        "page-4.description": "<p>Когда структура уровня готова, пришло время улучшить визуальную составляющую с помощью custom tile mapping.</p><p>В этом упражнении вы определите, как выглядят tiles, указав список <strong>tile IDs</strong> (ordinal values), которые будут привязаны к конкретным типам wall tiles.</p><p>Каждый tile ID, который вы укажете, автоматически будет назначен к соответствующему tile-коду: первый станет <code>W0</code>, второй <code>W1</code>, и так далее — до <code>WN</code>, где <strong>N</strong> — индекс последнего значения.</p><p>Введите свои tile IDs ниже, через запятую (например <code>17, 21, 34, 56</code>). Эти значения управляют тем, как будет выглядеть каждая wall tile в финальной версии игры.</p><p>Здесь можно проявить креативность! Представляйте, что эти tile IDs — стили или текстуры: потрескавшийся камень, мох, сломанная стена, и т.д. Но соблюдайте порядок относительно того, как будете использовать <code>W0</code>, <code>W1</code>, и т.п. в layout.</p><p>Ниже изображение, помогающее определить tiles.</p><img src=\"@public/tiles-examples-walls.png\" width=\"500\"></img><a class=\"button\" href=\"@public/tiles-examples-full.png\" target=\"__blank\"><img src=\"@public/icons/arrow-up-right-square-fill.svg\" />See full tilemap</a>",
        "page-4.walls.title": "Wall tile IDs:",
        "page-4.walls.description": "Подсказка: список чисел через запятую.",

        "page-5.title": "Упражнение 5: Добавляем монетки",
        "page-5.description": "<p>Теперь пора наполнить лабиринт коллекционными <strong>coins</strong>, чтобы сделать gameplay более вознаграждающим.</p><p>В этом упражнении вы определите coin tiles, которые игрок может собирать, указав список <strong>tile IDs</strong> (ordinal values) и при желании назначив им разные очки (scores). Каждый coin tile ID будет сопоставлен с кодом начиная с <code>C0</code>, <code>C1</code> и т.д.— до <code>CN</code>, где <strong>N</strong> — последний coin.</p><p>Есть три части настройки:</p><ol><li><strong>Default Coin Score</strong>: положительное число, которое используется для любого coin'а без кастомного score.</li> <li><strong>Scores List</strong>: список конкретных очков для каждого coin'а. Каждая строка: <code>X Y</code>, где <code>X</code> — coin code (номер в <code>C0</code>, <code>C1</code>...) и <code>Y</code> — score. Пример: <pre>0 5</pre><pre>2 10</pre></li><li><strong>Coin Tile IDs list</strong>: список tile IDs (например <code>12, 23, 45</code>), которые будут использоваться для coins. Эти значения соответствуют tiles ниже и будут мапиться на <code>C0</code>, <code>C1</code> и т.д.</li></ol><p>Как только coins и scores определены, вы сможете размещать их прямо в layout используя коды <code>CX</code>.</p><p>Ниже изображение для выбора coin tiles:</p><img src=\"@public/tiles-examples-gems.png\" width=\"500\" /><p>Добавьте coins с помощью полей ниже, затем обновите свой layout. Удачи в создании collectible paths!</p><a class=\"button\" href=\"@public/tiles-examples-full-gems.png\" target=\"__blank\"><img src=\"@public/icons/arrow-up-right-square-fill.svg\" />See Gems tilemap</a>",
        "page-5.default-score.title": "[Необязательное задание] Значение очков по-умолчанию:",
        "page-5.default-score.description": "Подсказка: одно положительное число.",
        "page-5.values.title": "[Необязательное задание] Значения:",
        "page-5.values.description": "Подсказка: список пар, каждая в новой строке. Каждая пара состоит из coin id и score через пробел.",
        "page-5.tiles.title": "Coin tile IDs:",
        "page-5.tiles.description": "Подсказка: список чисел через запятую.",


        "page-6.title": "Упражнение 6: Динамическое устройство лабиринта",
        "page-6.description": "<p>Теперь усложним core game mechanic: сделаем layout динамическим, введя <strong class=\"highlight\">keys и doors</strong>. Эта фича добавляет челлендж и прогрессию, требуя собирать ключи для открытия соответствующих дверей.</p><p>В этом упражнении вы определите, какие tile IDs представляют <strong>keys</strong>, <strong>doors</strong> и, при желании, <strong>closed doors</strong>. Каждая пара key/door будет иметь уникальный код: <code>K0</code>/<code>D0</code>, <code>K1</code>/<code>D1</code> и т.д.</p><p>Как настроить:</p><ol><li><strong>Keys</strong>: введите tile IDs всех ключей в уровне (например <code>14, 33, 47</code>). Первый ID станет <code>K0</code>, второй <code>K1</code> и т.д.</li><li><strong>Doors</strong>: соответствующие tile IDs для дверей (например <code>28, 39, 52</code>). Они будут назначены как <code>D0</code>, <code>D1</code> и т.д. Должно быть ровно столько дверей, сколько ключей.</li> <li><strong>Open Door Tile IDs</strong>: список tiles для открытых дверей. Персонаж может проходить через открытые двери. Если указано одно значение — все двери будут использовать его. Если больше — их количество должно совпадать с количеством дверей и быть в том же порядке.</li></ol><p>После определения ключей и дверей вы сможете размещать их в layout используя <code>K0</code>, <code>K1</code> ... и <code>D0</code>, <code>D1</code>...</p><p>Эти изображения помогут выбрать нужные IDs:</p><p><strong>Key Tile IDs</strong>:</p><img src=\"@public/tiles-examples-keys.png\" width=\"500\" /><p><strong>Door Tile IDs</strong>:</p> <img src=\"@public/tiles-examples-doors.png\" width=\"500\" /><p>Это сделает ваш лабиринт более интерактивным и стратегичным!</p><a class=\"button\" href=\"@public/tiles-examples-full-tools.png\" target=\"__blank\"><img src=\"@public/icons/arrow-up-right-square-fill.svg\" />See Tools tilemap</a><a class=\"button\" href=\"@public/tiles-examples-full.png\" target=\"__blank\"><img src=\"@public/icons/arrow-up-right-square-fill.svg\" />See full tilemap</a>",
        "page-6.keys.title": "Key tile IDs:",
        "page-6.keys.description": "Подсказка: список чисел через запятую.",
        "page-6.close-doors.title": "Closed door tile IDs:",
        "page-6.close-doors.description": "Подсказка: список чисел через запятую.",
        "page-6.open-doors.title": "Open door tile IDs:",
        "page-6.open-doors.description": "Подсказка: одно число или список чисел через запятую.",

        "page-7.title": "Упражнение 7: Монстры 👿",
        "page-7.description": "<p>Пора оживить уровень с помощью <strong>monster logic</strong>! В этом упражнении вы определите поведение монстров: точки появления, паттерны движения и частоту обновления.</p><p>Конфигурации монстров задаются текстом ниже. Каждая строка — один монстр и должна быть в формате:</p><pre>tileID updateTimeMs direction1 direction2 ... directionN</pre><p>Что это значит:</p><ul><li><strong>tileID</strong>: tile ID, представляющий монстра визуально.</li><li><strong>updateTimeMs</strong>: время (миллисекунды) между перемещениями. Например <code>500</code> — монстр двигается два раза в секунду (каждые полсекунды).</li><li><strong>directions</strong>: последовательность направлений. Возможные значения: <code>left</code>, <code>right</code>, <code>up</code>, <code>down</code>. <strong>Список направлений должен приводить монстра в ту же точку, где он начал.</strong></li></ul><p>Первый монстр — <code>M0</code>, второй — <code>M1</code>, и т.д.</p> <p>Пример:</p> <pre>27 1000 right down down up up left<br>33 500 left left right right</pre><p>В этом примере: <ul><li><code>M0</code> использует tile 27, обновляется каждые 1000ms и движется по паттерну, похожему на коня (в шахматах).</li><li><code>M1</code> использует tile 33, обновляется каждые 500ms и ходит два шага влево и возвращается вправо, повторяя паттерн.</li></ul></p> <p>Определив монстров, размещайте их в layout с помощью <code>M0</code>, <code>M1</code> и т.д.</p> <p>Эта логика позволяет создавать patrol patterns, chase paths или timed threats. Проявите креатив!</p><p>Ниже изображение tiles монстров:</p><img src=\"@public/tiles-examples-creatures.png\" width=\"600\"></img><a class=\"button\" href=\"@public/tiles-examples-full-creatures.png\" target=\"__blank\"><img src=\"@public/icons/arrow-up-right-square-fill.svg\" />See Creatures tilemap</a>",
        "page-7.monsters.title": "Конфигурация монстров:",
        "page-7.monsters.description": "Подсказка: несколько строк. Каждая строка — tileID updateTimeMs direction1 direction2 ... directionN.",


        "page-8.title": "Упражнение 8: 🐣 Пасхальные яйца?!",
        "page-8.description": "<p>Мы почти закончили! Теперь добавим последние штрихи с помощью <strong>вспомогательных элементов</strong>, чтобы сделать уровень живым и законченным.</p><p>Это упражнение про то, какие tiles представляют эти элементы.</p><p>Garnitures — это декоративные визуальные элементы (трава, факелы, баннеры и т.п.), которые не влияют на gameplay… или влияют? 🙂</p><p>Ниже есть одно поле:</p><ol><li><strong>Garniture Tile IDs</strong>: список tile IDs, каждый в новой строке, с boolean-флагом (<code>true</code> или <code>false</code>), указывающим, должны ли они быть collideable (например <code>201 false<br>301 true</code>). Строки будут мапиться на <code>G0</code>, <code>G1</code> ... <code>GN</code>.</li></ol><p>После определения garnitures, можно размещать их прямо в layout.</p><p>Пример «хитрости»: можно использовать не-collideable garniture, выглядящую как стена, чтобы сделать скрытый проход (но лучше слегка отличать плитку, чтобы игрок мог заметить намёк).</p><p>Это помогает «полировать» layout и добавляет challenge.</p><p>Готовы завершать уровень? Добавьте garnitures ниже и обновите layout.</p><p>Ниже изображение garniture tile IDs:</p><img src=\"@public/tiles-examples-garnitures.png\" width=\"350\"></img><a class=\"button\" href=\"@public/tiles-examples-full.png\" target=\"__blank\"><img src=\"@public/icons/arrow-up-right-square-fill.svg\" />See full tilemap</a>",
        "page-8.garniture.title": "Конфигурация вспомогательных элементов:",
        "page-8.garniture.description": "Подсказка: несколько строк. Каждая строка — tileID и boolean флаг через пробел.",

        "page-9.title": "Упражнение 9: Тестирование и полировка",
        "page-9.description": "<p>Вы сделали огромный путь! Теперь пора протестировать уровень и отполировать детали.</p><p>После завершения всех предыдущих упражнений, нажмите кнопку <strong>Play</strong> справа вверху интерфейса и пройдите свой лабиринт как игрок.</p><p>На что обратить внимание:</p><ul><li>Есть ли тупики без смысла?</li><li>Понятно ли, что нужно делать?</li><li>Все ли монстры работают ожидаемо?</li><li>Удаётся ли собрать все coins?</li><li>Слишком легко? Слишком сложно?</li></ul><p>Постарайтесь многократно пройти лабиринт и каждый раз \"почувствовать\" его как игрок.</p><p>После теста вернитесь к предыдущим шагам и внесите изменения. Иногда даже маленькое перемещение одной стены меняет ощущения целиком!</p><p>Когда почувствуете, что лабиринт стал приятным и сбалансированным — вы готовы к последнему шагу.</p><img src=\"@public/tiles-examples-flags.png\" width=\"500\"></img><p>Время помахать флагами!</p><a class=\"button\" href=\"@public/tiles-examples-full.png\" target=\"__blank\"><img src=\"@public/icons/arrow-up-right-square-fill.svg\" />See full tilemap</a>",


        "page-10.title": "Упражнение 10: Ограничения уровня",
        "page-10.description": "<p>Теперь, когда ваш уровень построен и украшен, сделаем его сложнее, определив <strong>ограничения и условия победы</strong>.</p><p>В этом упражнении вы настроите поведение уровня с точки зрения времени, количества ходов и очков. Эти ограничения помогают формировать сложность и стратегию — заставляя игрока планировать, двигаться экономно или собирать больше, чтобы выиграть.</p><p>Вы можете настроить следующие параметры:</p><ol><li><strong>Максимальное время (в секундах)</strong>: общее время, которое есть у игрока.</li><li><strong>Максимум ходов</strong>: сколько ходов игрок может сделать.</li><li><strong>Минимальный счёт</strong>: минимальный счёт, который игрок должен собрать, чтобы появился флаг на уровне.</li></ol><p>Пример конфигурации:</p><pre> Max time: 60<br>Max steps: 200</pre><p>В таком случае у игрока есть 60 секунд и 200 ходов, чтобы пройти уровень.</p><p>Готовы настроить сложность? Введите значения ниже и протестируйте, как они меняют gameplay!</p>",
        "page-10.max-time.title": "[Опционально] Максимальное время:",
        "page-10.max-time.description": "Подсказка: положительное число в секундах.",
        "page-10.max-moves.title": "[Опционально] Максимум ходов:",
        "page-10.max-moves.description": "Подсказка: положительное число — сколько ходов можно сделать до завершения игры.",
        "page-10.min-score.title": "[Опционально] Минимальный счёт:",
        "page-10.min-score.description": "Подсказка: положительное число — когда появляется флаг на уровне.",


        "page-11.title": "Упражнение 11: Спецэффекты",
        "page-11.description": "<p>Вы построили уровень, добавили игровые элементы и настроили правила. Теперь пора дать уровню имя и добавить <strong>спецэффекты</strong>, чтобы он действительно выделялся!</p><p>В этом упражнении вы укажете <strong>название уровня</strong> и при желании включите <strong>пост-обработку</strong>, которая изменяет внешний вид и ощущение во время игры.</p><p>Есть три настройки:</p><ol><li><strong>Название уровня:</strong> короткое и запоминающееся. Показывается в правом верхнем углу.</li><li><strong>Эффект Cathode Ray Tube:</strong> включает лёгкую «ретро»-деформацию и линии сканирования, как на старых телевизорах. Отлично для ретро-стиля 📺</li><li><strong>Эффект Fog of War:</strong> ограничивает видимость, показывая только область рядом с игроком. Добавляет челлендж и атмосферу.</li></ol><p>С такими настройками уровень получает «старо-телевизионный» драматичный вид, а игрок видит лишь небольшую область вокруг — исследование становится напряжённее.</p>",
        "page-11.level-title.title": "Название уровня:",
        "page-11.level-title.description": "Подсказка: строка максимум 20 символов.",
        "page-11.level-title.placeholder": "Мой первый уровень",
        "page-11.effect.crt.title": "Включить Cathode Ray Tube Effect",
        "page-11.effect.crt.description": "Симулирует старый пузатый телевизор 📺",
        "page-11.effect.fow.title": "Включить Fog of War",
        "page-11.effect.fow.description": "Ограничивает видимость очень маленькой областью.",


        "page-12.title": "Упражнение 12: Рефлексируй и улучшай механику",
        "page-12.description": "<p>В самом первом упражнении вы выбрали игровые механики, которые хотели улучшить или добавить.</p><p>Теперь, когда уровень построен и настроен, пора взглянуть на результат.</p><p>Используйте поле ниже, чтобы:</p><ul><li>описать, какие механики вы хотели улучшить или добавить;</li><li>объяснить, как вы реализовали их в своём уровне;</li><li>сравнить начальные идеи с итоговой реализацией — что изменилось, что получилось хорошо, а что можно улучшить.</li></ul><p>Это упражнение помогает критически подумать о своих дизайнерских решениях и учиться на собственном процессе.</p>",
        "page-12.features.title": "Механики:",
        "page-12.features.description": "Вернитесь к выбранным механикам и проверьте, подходят ли они.",
        "page-12.features.placeholder": "Случайный спавн персонажа на старте\nИгрок собирает монетки\n…",


        "page-13.title": "Упражнение 13: Поделись своей работой",
        "page-13.description": "<p>Вы завершили уровень. Пора дать другим его попробовать — как это делают настоящие разработчики, готовя игру к продакшену!</p><p>В этом упражнении вы скачаете <strong>конфигурацию уровня</strong>, созданную во время воркшопа, и поделитесь ею с другим студентом. Так вы сможете изучить работу друг друга, обменяться фидбэком и вдохновиться новыми подходами.</p><p>Нажмите <strong>Download my config</strong>, чтобы сохранить конфиг. В нём содержатся все настройки, тайлы и параметры уровня.</p><p>Поделитесь файлом: например через USB, мессенджер или просто поменяйтесь устройствами.</p><p>Загрузите чужой конфиг через <strong>Load someone's config</strong>.</p><p>Обсудите сходства, различия и дайте конструктивный фидбэк.</p>",
        "page-13.share.title": "Поделиться конфигом:",
        "page-13.share.description": "Время выпустить конфиг в продакшен. Используйте кнопки ниже для скачивания и загрузки.",


        "page-demo-local-config.title": "Загрузить свой конфиг",
        "page-demo-local-config.description": "<p>Добро пожаловать в инструмент, позволяющий загружать пользовательские конфиги в игру.</p><p>Он демонстрирует гибкость движка и работу с пользовательскими файлами.</p>",
        "page-demo-local-config.upload.title": "Загрузчик конфига:",
        "page-demo-local-config.upload.description": "Download сохраняет глобальный конфиг, Upload запускает игру с локального файла.",


        "page-demo-ri-meeting.title": "Понедельничный питчинг в Royal Institution",
        "page-demo-ri-meeting.description": "<p>Добро пожаловать на питчинг от <strong>21.07.25</strong></p><p>Эта демонстрация показывает полный прогресс возможных упражнений. Студенты начинают с исследования, что делает игру игрой — её механики, цели и gameplay — затем анализируют пример лабиринта, чтобы определить существующие правила и придумать новые.</p><p>Далее — строят собственный уровень на основе data-driven дизайна: стены, тайлы, логика, визуал.</p><p>Затем — coins с разными значениями, двери, ключи, и дизайн-челлендж по их размещению.</p><p>Потом — простые идеи ИИ, паттерны монстров на конфигурации.</p><p>И наконец — творческие идеи: секреты, пасхалки, лимиты ходов, таймеры, коллекции, чтобы сделать игру уникальной и интересной.</p><p>Это полный путь через основы гейм-дизайна через практику. Весёлого творчества!</p><p>В этом демо-наборе уровней:</p><ol><li>Введение и базовые механики</li><li>Гемы</li><li>Двери</li><li>AI монстров</li><li>Декор: пасхалки</li><li>Эффекты: Fog of War</li><li>Кастомные стены</li></ol><p>Конфиг можно найти <a href=\"https://github.com/st235/RoyalInstitution.IntroductionToGameDevelopment.v4/blob/main/src/assets/game/demos/ri_monday_demo.json\" target=\"_blank\">тут</a>.</p>"
    }
}
